name: "forward"

layer{
  type: "PlaceholderOp"
  top: "arg0_1"
  layer_param{
    shape: [1, 128]
    dtype: "TensorDType.Int64"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg1_1"
  layer_param{
    shape: [65024, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg2_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg3_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg4_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg5_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg6_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg7_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg8_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg9_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg10_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg11_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg12_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg13_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg14_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg15_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg16_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg17_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg18_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg19_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg20_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg21_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg22_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg23_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg24_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg25_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg26_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg27_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg28_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg29_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg30_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg31_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg32_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg33_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg34_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg35_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg36_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg37_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg38_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg39_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg40_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg41_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg42_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg43_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg44_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg45_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg46_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg47_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg48_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg49_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg50_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg51_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg52_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg53_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg54_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg55_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg56_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg57_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg58_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg59_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg60_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg61_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg62_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg63_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg64_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg65_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg66_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg67_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg68_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg69_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg70_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg71_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg72_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg73_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg74_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg75_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg76_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg77_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg78_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg79_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg80_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg81_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg82_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg83_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg84_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg85_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg86_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg87_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg88_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg89_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg90_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg91_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg92_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg93_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg94_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg95_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg96_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg97_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg98_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg99_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg100_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg101_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg102_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg103_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg104_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg105_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg106_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg107_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg108_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg109_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg110_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg111_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg112_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg113_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg114_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg115_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg116_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg117_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg118_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg119_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg120_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg121_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg122_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg123_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg124_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg125_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg126_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg127_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg128_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg129_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg130_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg131_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg132_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg133_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg134_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg135_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg136_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg137_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg138_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg139_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg140_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg141_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg142_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg143_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg144_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg145_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg146_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg147_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg148_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg149_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg150_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg151_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg152_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg153_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg154_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg155_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg156_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg157_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg158_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg159_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg160_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg161_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg162_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg163_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg164_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg165_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg166_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg167_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg168_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg169_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg170_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg171_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg172_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg173_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg174_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg175_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg176_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg177_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg178_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg179_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg180_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg181_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg182_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg183_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg184_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg185_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg186_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg187_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg188_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg189_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg190_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg191_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg192_1"
  layer_param{
    shape: [4608, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg193_1"
  layer_param{
    shape: [4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg194_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg195_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg196_1"
  layer_param{
    shape: [27392, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg197_1"
  layer_param{
    shape: [4096, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg198_1"
  layer_param{
    shape: [4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg199_1"
  layer_param{
    shape: [65024, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "EmbeddingOp"
  top: "embedding"
  bottom: "arg1_1"
  bottom: "arg0_1"
  layer_param{
    shape: [1, 128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "transpose"
  bottom: "embedding"
  layer_param{
    attr_0: 0
    attr_1: 1
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ArangeOp"
  top: "arange"
  layer_param{
    attr_0: 0
    attr_1: 64
    attr_2: 2
    shape: [32]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "DivOp"
  top: "div"
  bottom: "arange"
  layer_param{
    attr_0: 64
    shape: [32]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PowOp"
  top: "pow_1"
  bottom: "div"
  layer_param{
    attr_0: "div"
    shape: [32]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ReciprocalOp"
  top: "reciprocal"
  bottom: "pow_1"
  layer_param{
    shape: [32]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MulOp"
  top: "mul"
  bottom: "reciprocal"
  layer_param{
    attr_0: 1.0
    shape: [32]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ArangeOp"
  top: "arange_1"
  layer_param{
    attr_0: 32768
    shape: [32768]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view"
  bottom: "arange_1"
  layer_param{
    attr_0: [32768, 1]
    shape: [32768, 1]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MulOp"
  top: "mul_1"
  bottom: "view"
  bottom: "mul"
  layer_param{
    shape: [32768, 32]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "CosOp"
  top: "cos"
  bottom: "mul_1"
  layer_param{
    shape: [32768, 32]
    dtype: "TensorDType.Float32"
  }
}

layer{
  type: "SinOp"
  top: "sin"
  bottom: "mul_1"
  layer_param{
    shape: [32768, 32]
    dtype: "TensorDType.Float32"
  }
}

layer{
  type: "StackOp"
  top: "stack"
  bottom: "cos"
  bottom: "sin"
  layer_param{
    attr_0: -1
    shape: [32768, 32, 2]
    dtype: "TensorDType.Float32"
  }
}

layer{
  type: "UnsqueezeOp"
  top: "unsqueeze"
  bottom: "stack"
  layer_param{
    attr_0: 0
    shape: [1, 32768, 32, 2]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "SliceOp"
  top: "slice_1"
  bottom: "unsqueeze"
  layer_param{
    attr_0: 1
    attr_1: 0
    attr_2: 128
    shape: [1, 128, 32, 2]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "transpose_1"
  bottom: "slice_1"
  layer_param{
    attr_0: 0
    attr_1: 1
    shape: [128, 1, 32, 2]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_1"
  bottom: "fuse_ln_mul_3"
  layer_param{
    attr_0: [128, 4096]
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "t"
  bottom: "arg3_1"
  layer_param{
    shape: [4096, 4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "AddMMOp"
  top: "addmm"
  bottom: "arg4_1"
  bottom: "view_1"
  bottom: "t"
  layer_param{
    shape: [128, 4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_2"
  bottom: "addmm"
  layer_param{
    attr_0: [128, 1, 4608]
    shape: [128, 1, 4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "SplitWithSizeOp"
  top: "split_with_sizes"
  bottom: "view_2"
  layer_param{
    attr_0: [4096, 256, 256]
    attr_1: -1
    shape{
      output_0: [128, 1, 4096]
      output_1: [128, 1, 256]
      output_2: [128, 1, 256]
    }
  }
}

layer{
  type: "GetItemOp"
  top: "getitem"
  bottom: "split_with_sizes"
  layer_param{
    attr_0: 0
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_1"
  bottom: "split_with_sizes"
  layer_param{
    attr_0: 1
    shape: [128, 1, 256]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_2"
  bottom: "split_with_sizes"
  layer_param{
    attr_0: 2
    shape: [128, 1, 256]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_3"
  bottom: "getitem"
  layer_param{
    attr_0: [128, 1, 32, 128]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_4"
  bottom: "getitem_1"
  layer_param{
    attr_0: [128, 1, 2, 128]
    shape: [128, 1, 2, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_5"
  bottom: "getitem_2"
  layer_param{
    attr_0: [128, 1, 2, 128]
    shape: [128, 1, 2, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "RotaryPosEmbOp"
  top: "rotary_pos_emb"
  bottom: "view_3"
  bottom: "transpose_1"
  layer_param{
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "RotaryPosEmbOp"
  top: "rotary_pos_emb_1"
  bottom: "view_4"
  bottom: "transpose_1"
  layer_param{
    shape: [128, 1, 2, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "UnsqueezeOp"
  top: "unsqueeze_1"
  bottom: "rotary_pos_emb_1"
  layer_param{
    attr_0: -2
    shape: [128, 1, 2, 1, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ExpandOp"
  top: "expand"
  bottom: "unsqueeze_1"
  layer_param{
    attr_0: [-1, -1, -1, 16, -1]
    shape: [128, 1, 2, 16, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_6"
  bottom: "expand"
  layer_param{
    attr_0: [128, 1, 32, 128]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "UnsqueezeOp"
  top: "unsqueeze_2"
  bottom: "view_5"
  layer_param{
    attr_0: -2
    shape: [128, 1, 2, 1, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ExpandOp"
  top: "expand_1"
  bottom: "unsqueeze_2"
  layer_param{
    attr_0: [-1, -1, -1, 16, -1]
    shape: [128, 1, 2, 16, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_7"
  bottom: "expand_1"
  layer_param{
    attr_0: [128, 1, 32, 128]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute"
  bottom: "rotary_pos_emb"
  layer_param{
    attr_0: [1, 2, 0, 3]
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute_1"
  bottom: "view_6"
  layer_param{
    attr_0: [1, 2, 0, 3]
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute_2"
  bottom: "view_7"
  layer_param{
    attr_0: [1, 2, 0, 3]
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ScaledDotProductFlashAttentionForCpuOp"
  top: "_scaled_dot_product_flash_attention_for_cpu"
  bottom: "permute"
  bottom: "permute_1"
  bottom: "permute_2"
  layer_param{
    attr_0: 0.0
    attr_1: True
    shape{
      output_0: [1, 32, 128, 128]
      output_1: [1, 32, 128]
    }
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_3"
  bottom: "_scaled_dot_product_flash_attention_for_cpu"
  layer_param{
    attr_0: 0
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute_3"
  bottom: "getitem_3"
  layer_param{
    attr_0: [2, 0, 1, 3]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_8"
  bottom: "permute_3"
  layer_param{
    attr_0: [128, 1, 4096]
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "t_1"
  bottom: "arg5_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_9"
  bottom: "view_8"
  layer_param{
    attr_0: [128, 4096]
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MatmulOp"
  top: "mm"
  bottom: "view_9"
  bottom: "t_1"
  layer_param{
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "_unsafe_view"
  bottom: "mm"
  layer_param{
    attr_0: [128, 1, 4096]
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "AddOp"
  top: "add_1"
  bottom: "transpose"
  bottom: "_unsafe_view"
  layer_param{
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "t_2"
  bottom: "arg7_1"
  layer_param{
    shape: [4096, 27392]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_10"
  bottom: "fuse_ln_mul_5"
  layer_param{
    attr_0: [128, 4096]
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MatmulOp"
  top: "mm_1"
  bottom: "view_10"
  bottom: "t_2"
  layer_param{
    shape: [128, 27392]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "_unsafe_view_1"
  bottom: "mm_1"
  layer_param{
    attr_0: [128, 1, 27392]
    shape: [128, 1, 27392]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "SplitOp"
  top: "split"
  bottom: "_unsafe_view_1"
  layer_param{
    attr_0: 13696
    attr_1: -1
    shape{
      output_0: [128, 1, 13696]
      output_1: [128, 1, 13696]
    }
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_5"
  bottom: "split"
  layer_param{
    attr_0: 0
    shape: [128, 1, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_6"
  bottom: "split"
  layer_param{
    attr_0: 1
    shape: [128, 1, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "SiluOp"
  top: "silu"
  bottom: "getitem_5"
  layer_param{
    shape: [128, 1, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MulOp"
  top: "mul_6"
  bottom: "silu"
  bottom: "getitem_6"
  layer_param{
    shape: [128, 1, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "t_3"
  bottom: "arg8_1"
  layer_param{
    shape: [13696, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_11"
  bottom: "mul_6"
  layer_param{
    attr_0: [128, 13696]
    shape: [128, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MatmulOp"
  top: "mm_2"
  bottom: "view_11"
  bottom: "t_3"
  layer_param{
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "_unsafe_view_2"
  bottom: "mm_2"
  layer_param{
    attr_0: [128, 1, 4096]
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "AddOp"
  top: "add_3"
  bottom: "add_1"
  bottom: "_unsafe_view_2"
  layer_param{
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_12"
  bottom: "fuse_ln_mul_8"
  layer_param{
    attr_0: [128, 4096]
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "t_4"
  bottom: "arg10_1"
  layer_param{
    shape: [4096, 4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "AddMMOp"
  top: "addmm_1"
  bottom: "arg11_1"
  bottom: "view_12"
  bottom: "t_4"
  layer_param{
    shape: [128, 4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_13"
  bottom: "addmm_1"
  layer_param{
    attr_0: [128, 1, 4608]
    shape: [128, 1, 4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "SplitWithSizeOp"
  top: "split_with_sizes_1"
  bottom: "view_13"
  layer_param{
    attr_0: [4096, 256, 256]
    attr_1: -1
    shape{
      output_0: [128, 1, 4096]
      output_1: [128, 1, 256]
      output_2: [128, 1, 256]
    }
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_7"
  bottom: "split_with_sizes_1"
  layer_param{
    attr_0: 0
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_8"
  bottom: "split_with_sizes_1"
  layer_param{
    attr_0: 1
    shape: [128, 1, 256]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_9"
  bottom: "split_with_sizes_1"
  layer_param{
    attr_0: 2
    shape: [128, 1, 256]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_14"
  bottom: "getitem_7"
  layer_param{
    attr_0: [128, 1, 32, 128]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_15"
  bottom: "getitem_8"
  layer_param{
    attr_0: [128, 1, 2, 128]
    shape: [128, 1, 2, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_16"
  bottom: "getitem_9"
  layer_param{
    attr_0: [128, 1, 2, 128]
    shape: [128, 1, 2, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "RotaryPosEmbOp"
  top: "rotary_pos_emb_2"
  bottom: "view_14"
  bottom: "transpose_1"
  layer_param{
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "RotaryPosEmbOp"
  top: "rotary_pos_emb_3"
  bottom: "view_15"
  bottom: "transpose_1"
  layer_param{
    shape: [128, 1, 2, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "UnsqueezeOp"
  top: "unsqueeze_3"
  bottom: "rotary_pos_emb_3"
  layer_param{
    attr_0: -2
    shape: [128, 1, 2, 1, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ExpandOp"
  top: "expand_2"
  bottom: "unsqueeze_3"
  layer_param{
    attr_0: [-1, -1, -1, 16, -1]
    shape: [128, 1, 2, 16, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_17"
  bottom: "expand_2"
  layer_param{
    attr_0: [128, 1, 32, 128]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "UnsqueezeOp"
  top: "unsqueeze_4"
  bottom: "view_16"
  layer_param{
    attr_0: -2
    shape: [128, 1, 2, 1, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ExpandOp"
  top: "expand_3"
  bottom: "unsqueeze_4"
  layer_param{
    attr_0: [-1, -1, -1, 16, -1]
    shape: [128, 1, 2, 16, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_18"
  bottom: "expand_3"
  layer_param{
    attr_0: [128, 1, 32, 128]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute_4"
  bottom: "rotary_pos_emb_2"
  layer_param{
    attr_0: [1, 2, 0, 3]
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute_5"
  bottom: "view_17"
  layer_param{
    attr_0: [1, 2, 0, 3]
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute_6"
  bottom: "view_18"
  layer_param{
    attr_0: [1, 2, 0, 3]
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ScaledDotProductFlashAttentionForCpuOp"
  top: "_scaled_dot_product_flash_attention_for_cpu_1"
  bottom: "permute_4"
  bottom: "permute_5"
  bottom: "permute_6"
  layer_param{
    attr_0: 0.0
    attr_1: True
    shape{
      output_0: [1, 32, 128, 128]
      output_1: [1, 32, 128]
    }
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_10"
  bottom: "_scaled_dot_product_flash_attention_for_cpu_1"
  layer_param{
    attr_0: 0
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute_7"
  bottom: "getitem_10"
  layer_param{
    attr_0: [2, 0, 1, 3]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_19"
  bottom: "permute_7"
  layer_param{
    attr_0: [128, 1, 4096]
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "t_5"
  bottom: "arg12_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_20"
  bottom: "view_19"
  layer_param{
    attr_0: [128, 4096]
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MatmulOp"
  top: "mm_3"
  bottom: "view_20"
  bottom: "t_5"
  layer_param{
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "_unsafe_view_3"
  bottom: "mm_3"
  layer_param{
    attr_0: [128, 1, 4096]
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "AddOp"
  top: "add_5"
  bottom: "add_3"
  bottom: "_unsafe_view_3"
  layer_param{
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "t_6"
  bottom: "arg14_1"
  layer_param{
    shape: [4096, 27392]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_21"
  bottom: "fuse_ln_mul_10"
  layer_param{
    attr_0: [128, 4096]
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MatmulOp"
  top: "mm_4"
  bottom: "view_21"
  bottom: "t_6"
  layer_param{
    shape: [128, 27392]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "_unsafe_view_4"
  bottom: "mm_4"
  layer_param{
    attr_0: [128, 1, 27392]
    shape: [128, 1, 27392]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "SplitOp"
  top: "split_1"
  bottom: "_unsafe_view_4"
  layer_param{
    attr_0: 13696
    attr_1: -1
    shape{
      output_0: [128, 1, 13696]
      output_1: [128, 1, 13696]
    }
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_12"
  bottom: "split_1"
  layer_param{
    attr_0: 0
    shape: [128, 1, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_13"
  bottom: "split_1"
  layer_param{
    attr_0: 1
    shape: [128, 1, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "SiluOp"
  top: "silu_1"
  bottom: "getitem_12"
  layer_param{
    shape: [128, 1, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MulOp"
  top: "mul_11"
  bottom: "silu_1"
  bottom: "getitem_13"
  layer_param{
    shape: [128, 1, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "t_7"
  bottom: "arg15_1"
  layer_param{
    shape: [13696, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_22"
  bottom: "mul_11"
  layer_param{
    attr_0: [128, 13696]
    shape: [128, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MatmulOp"
  top: "mm_5"
  bottom: "view_22"
  bottom: "t_7"
  layer_param{
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "_unsafe_view_5"
  bottom: "mm_5"
  layer_param{
    attr_0: [128, 1, 4096]
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "AddOp"
  top: "add_7"
  bottom: "add_5"
  bottom: "_unsafe_view_5"
  layer_param{
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_23"
  bottom: "fuse_ln_mul_13"
  layer_param{
    attr_0: [128, 4096]
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "t_8"
  bottom: "arg17_1"
  layer_param{
    shape: [4096, 4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "AddMMOp"
  top: "addmm_2"
  bottom: "arg18_1"
  bottom: "view_23"
  bottom: "t_8"
  layer_param{
    shape: [128, 4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_24"
  bottom: "addmm_2"
  layer_param{
    attr_0: [128, 1, 4608]
    shape: [128, 1, 4608]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "SplitWithSizeOp"
  top: "split_with_sizes_2"
  bottom: "view_24"
  layer_param{
    attr_0: [4096, 256, 256]
    attr_1: -1
    shape{
      output_0: [128, 1, 4096]
      output_1: [128, 1, 256]
      output_2: [128, 1, 256]
    }
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_14"
  bottom: "split_with_sizes_2"
  layer_param{
    attr_0: 0
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_15"
  bottom: "split_with_sizes_2"
  layer_param{
    attr_0: 1
    shape: [128, 1, 256]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_16"
  bottom: "split_with_sizes_2"
  layer_param{
    attr_0: 2
    shape: [128, 1, 256]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_25"
  bottom: "getitem_14"
  layer_param{
    attr_0: [128, 1, 32, 128]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_26"
  bottom: "getitem_15"
  layer_param{
    attr_0: [128, 1, 2, 128]
    shape: [128, 1, 2, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_27"
  bottom: "getitem_16"
  layer_param{
    attr_0: [128, 1, 2, 128]
    shape: [128, 1, 2, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "RotaryPosEmbOp"
  top: "rotary_pos_emb_4"
  bottom: "view_25"
  bottom: "transpose_1"
  layer_param{
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "RotaryPosEmbOp"
  top: "rotary_pos_emb_5"
  bottom: "view_26"
  bottom: "transpose_1"
  layer_param{
    shape: [128, 1, 2, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "UnsqueezeOp"
  top: "unsqueeze_5"
  bottom: "rotary_pos_emb_5"
  layer_param{
    attr_0: -2
    shape: [128, 1, 2, 1, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ExpandOp"
  top: "expand_4"
  bottom: "unsqueeze_5"
  layer_param{
    attr_0: [-1, -1, -1, 16, -1]
    shape: [128, 1, 2, 16, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_28"
  bottom: "expand_4"
  layer_param{
    attr_0: [128, 1, 32, 128]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "UnsqueezeOp"
  top: "unsqueeze_6"
  bottom: "view_27"
  layer_param{
    attr_0: -2
    shape: [128, 1, 2, 1, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ExpandOp"
  top: "expand_5"
  bottom: "unsqueeze_6"
  layer_param{
    attr_0: [-1, -1, -1, 16, -1]
    shape: [128, 1, 2, 16, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_29"
  bottom: "expand_5"
  layer_param{
    attr_0: [128, 1, 32, 128]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute_8"
  bottom: "rotary_pos_emb_4"
  layer_param{
    attr_0: [1, 2, 0, 3]
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute_9"
  bottom: "view_28"
  layer_param{
    attr_0: [1, 2, 0, 3]
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute_10"
  bottom: "view_29"
  layer_param{
    attr_0: [1, 2, 0, 3]
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ScaledDotProductFlashAttentionForCpuOp"
  top: "_scaled_dot_product_flash_attention_for_cpu_2"
  bottom: "permute_8"
  bottom: "permute_9"
  bottom: "permute_10"
  layer_param{
    attr_0: 0.0
    attr_1: True
    shape{
      output_0: [1, 32, 128, 128]
      output_1: [1, 32, 128]
    }
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_17"
  bottom: "_scaled_dot_product_flash_attention_for_cpu_2"
  layer_param{
    attr_0: 0
    shape: [1, 32, 128, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "PermuteOp"
  top: "permute_11"
  bottom: "getitem_17"
  layer_param{
    attr_0: [2, 0, 1, 3]
    shape: [128, 1, 32, 128]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_30"
  bottom: "permute_11"
  layer_param{
    attr_0: [128, 1, 4096]
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "t_9"
  bottom: "arg19_1"
  layer_param{
    shape: [4096, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_31"
  bottom: "view_30"
  layer_param{
    attr_0: [128, 4096]
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MatmulOp"
  top: "mm_6"
  bottom: "view_31"
  bottom: "t_9"
  layer_param{
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "_unsafe_view_6"
  bottom: "mm_6"
  layer_param{
    attr_0: [128, 1, 4096]
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "AddOp"
  top: "add_9"
  bottom: "add_7"
  bottom: "_unsafe_view_6"
  layer_param{
    shape: [128, 1, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "TransposeOp"
  top: "t_10"
  bottom: "arg21_1"
  layer_param{
    shape: [4096, 27392]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "view_32"
  bottom: "fuse_ln_mul_15"
  layer_param{
    attr_0: [128, 4096]
    shape: [128, 4096]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "MatmulOp"
  top: "mm_7"
  bottom: "view_32"
  bottom: "t_10"
  layer_param{
    shape: [128, 27392]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "ViewOp"
  top: "_unsafe_view_7"
  bottom: "mm_7"
  layer_param{
    attr_0: [128, 1, 27392]
    shape: [128, 1, 27392]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "SplitOp"
  top: "split_2"
  bottom: "_unsafe_view_7"
  layer_param{
    attr_0: 13696
    attr_1: -1
    shape{
      output_0: [128, 1, 13696]
      output_1: [128, 1, 13696]
    }
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_19"
  bottom: "split_2"
  layer_param{
    attr_0: 0
    shape: [128, 1, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "GetItemOp"
  top: "getitem_20"
  bottom: "split_2"
  layer_param{
    attr_0: 1
    shape: [128, 1, 13696]
    dtype: "TensorDType.Float16"
  }
}

layer{
  type: "SiluOp"
