name: "forward"

layer{
  type: "PlaceholderOp"
  top: "arg0_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg1_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg2_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg3_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg4_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg5_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg6_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg7_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg8_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg9_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg10_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg11_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg12_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg13_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg14_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg15_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg16_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg17_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg18_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg19_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg20_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg21_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg22_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg23_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg24_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg25_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg26_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg27_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg28_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg29_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg30_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg31_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg32_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg33_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg34_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg35_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg36_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg37_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg38_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg39_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg40_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg41_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg42_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg43_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg44_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg45_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg46_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg47_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg48_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg49_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg50_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg51_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg52_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg53_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg54_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg55_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg56_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg57_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg58_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg59_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg60_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg61_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg62_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg63_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg64_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg65_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg66_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg67_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg68_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg69_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg70_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg71_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg72_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg73_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg74_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg75_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg76_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg77_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg78_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg79_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg80_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg81_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg82_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg83_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg84_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg85_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg86_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg87_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg88_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg89_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg90_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg91_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg92_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg93_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg94_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg95_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg96_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg97_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg98_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg99_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg100_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg101_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg102_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg103_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg104_1"
  layer_param{
    shape: [1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg105_1"
  layer_param{
    shape: [73440, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg106_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg107_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg108_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg109_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg110_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg111_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg112_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg113_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg114_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg115_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg116_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg117_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg118_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg119_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg120_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg121_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg122_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg123_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg124_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg125_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg126_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg127_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg128_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg129_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg130_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg131_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg132_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg133_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg134_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg135_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg136_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg137_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg138_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg139_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg140_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg141_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg142_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg143_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg144_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg145_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg146_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg147_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg148_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg149_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg150_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg151_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg152_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg153_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg154_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg155_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg156_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg157_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg158_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg159_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg160_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg161_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg162_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg163_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg164_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg165_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg166_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg167_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg168_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg169_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg170_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg171_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg172_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg173_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg174_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg175_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg176_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg177_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg178_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg179_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg180_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg181_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg182_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg183_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg184_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg185_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg186_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg187_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg188_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg189_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg190_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg191_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg192_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg193_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg194_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg195_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg196_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg197_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg198_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg199_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg200_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg201_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg202_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg203_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg204_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg205_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg206_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg207_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg208_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg209_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg210_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg211_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg212_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg213_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg214_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg215_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg216_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg217_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg218_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg219_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg220_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg221_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg222_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg223_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg224_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg225_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg226_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg227_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg228_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg229_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg230_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg231_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg232_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg233_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg234_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg235_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg236_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg237_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg238_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg239_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg240_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg241_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg242_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg243_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg244_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg245_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg246_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg247_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg248_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg249_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg250_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg251_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg252_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg253_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg254_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg255_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg256_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg257_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg258_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg259_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg260_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg261_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg262_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg263_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg264_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg265_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg266_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg267_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg268_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg269_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg270_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg271_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg272_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg273_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg274_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg275_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg276_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg277_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg278_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg279_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg280_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg281_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg282_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg283_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg284_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg285_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg286_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg287_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg288_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg289_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg290_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg291_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg292_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg293_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg294_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg295_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg296_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg297_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg298_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg299_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg300_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg301_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg302_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg303_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg304_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg305_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg306_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg307_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg308_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg309_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg310_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg311_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg312_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg313_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg314_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg315_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg316_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg317_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg318_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg319_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg320_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg321_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg322_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg323_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg324_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg325_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg326_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg327_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg328_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg329_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg330_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg331_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg332_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg333_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg334_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg335_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg336_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg337_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg338_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg339_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg340_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg341_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg342_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg343_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg344_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg345_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg346_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg347_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg348_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg349_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg350_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg351_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg352_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg353_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg354_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg355_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg356_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg357_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg358_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg359_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg360_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg361_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg362_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg363_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg364_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg365_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg366_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg367_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg368_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg369_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg370_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg371_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg372_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg373_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg374_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg375_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg376_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg377_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg378_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg379_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg380_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg381_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg382_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg383_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg384_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg385_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg386_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg387_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg388_1"
  layer_param{
    shape: [512, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg389_1"
  layer_param{
    shape: [1536, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg390_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg391_1"
  layer_param{
    shape: [3840, 1536]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg392_1"
  layer_param{
    shape: [1536, 3840]
    dtype: "TensorDType.BFloat16"
  }
}

layer{
  type: "PlaceholderOp"
  top: "arg393_1"
  layer_param{
    shape: [1536, 1536]
